import pandas as pd
import numpy as np

data = {'Учащийся': ['Иванов', "Коровьев", "Козлов", "Зарубина", "Баранов", "Самарская", "Васильева", "Петров",
                     "Сидоров", "Долина"],
        "Математика": [5, 5, 4, 2, 5, 3, 3, 5, 5, 4],
        "Физика": [5, 4, 5, 3,  5, 3, 2, 4, 5, 4],
        "Химия": [3, 3, 3, 4, 5, 3, 5, 5, 4, 2],
        "Биология": [5, 4, 3, 3, 4, 5, 2, 3, 3, 5],
        "Литература": [4, 5, 4, 5, 3, 3, 5, 5, 4, 3]}

df = pd.DataFrame(data)
# Выводим первые несколько строк DataFrame
print("Первые строки DataFrame:")
print(df.head())

# Вычисляем среднюю оценку по каждому предмету
mean_scores = df.mean(numeric_only=True)
print("\nСредняя оценка по каждому предмету:")
print(mean_scores)

# Вычисляем средние оценки для каждого ученика
df['Средняя оценка'] = df[['Математика', 'Физика', 'Химия', 'Биология', 'Литература']].mean(axis=1)
print("\nСредние оценки каждого ученика:")
print(df[['Учащийся', 'Средняя оценка']])

# Вычисляем медианную оценку по каждому предмету
median_scores = df.median(numeric_only=True)
print("\nМедианная оценка по каждому предмету:")
print(median_scores)

# Вычисляем Q1 и Q3 для оценок по математике
Q1_math = df['Математика'].quantile(0.25)
Q3_math = df['Математика'].quantile(0.75)
print("\nQ1 для математики:", Q1_math)
print("Q3 для математики:", Q3_math)

# Рассчитываем IQR для математики
IQR_math = Q3_math - Q1_math
print("IQR для математики:", IQR_math)

# Вычисляем стандартное отклонение по каждому предмету
std_dev = df.std(numeric_only=True)
print("\nСтандартное отклонение по каждому предмету:")
print(std_dev)

